microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51P19A.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!--
Copyright (c) 2017 Microchip Technology Inc.

SPDX-License-Identifier: Apache-2.0

Licensed under the Apache License, Version 2.0 (the "License"); you may
not use this file except in compliance with the License.
You may obtain a copy of the Licence at

http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an AS IS BASIS, WITHOUT
WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2017-08-03T21:21:39Z"/>
  <variants>
    <variant ordercode="SAMD51P19A-AU" package="TQFP128" pinout="SAMD51P" speedmax="150000000" tempmin="-40" tempmax="85" vccmin="1.71" vccmax="3.60"/>
    <variant ordercode="SAMD51P19A-AF" package="TQFP128" pinout="SAMD51P" speedmax="150000000" tempmin="-40" tempmax="125" vccmin="1.71" vccmax="3.60"/>
  </variants>
  <devices>
    <device name="ATSAMD51P19A" architecture="CORTEX-M4" family="SAMD" series="SAMD51">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="CMCC" start="0x03000000" size="0x1000000" type="io" rw="RW"/>
          <memory-segment name="CMCC_DATARAM" start="0x3000000" size="0x1000" type="io" rw="RW"/>
          <memory-segment name="CMCC_TAGRAM" start="0x3001000" size="0x400" type="io" rw="RW"/>
          <memory-segment name="CMCC_VALIDRAM" start="0x3002000" size="0x40" type="io" rw="RW"/>
          <memory-segment name="HSRAM" start="0x20000000" size="0x30000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HSRAM_ETB" start="0x20000000" size="0x8000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HSRAM_RET1" start="0x20000000" size="0x8000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HPB0" start="0x40000000" size="0x4400" type="io" rw="RW"/>
          <memory-segment name="HPB1" start="0x41000000" size="0x22000" type="io" rw="RW"/>
          <memory-segment name="HPB2" start="0x42000000" size="0x3C00" type="io" rw="RW"/>
          <memory-segment name="HPB3" start="0x43000000" size="0x3000" type="io" rw="RW"/>
          <memory-segment name="FLASH" start="0x00000000" size="0x80000" type="flash" pagesize="512" rw="RW" exec="true"/>
          
          <memory-segment name="AUX0" start="0x00804000" size="0x200" type="user_page" pagesize="16" rw="RW"/>
          <memory-segment name="SEEPROM" start="0x44000000" size="0x20000" type="io" rw="RW"/>
          <memory-segment name="BKUPRAM" start="0x47000000" size="0x2000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW"/>
          <memory-segment name="QSPI" start="0x04000000" size="0x1000000" type="other" rw="RW" exec="true" external="true"/>
          <memory-segment name="SDHC0" start="0x45000000" size="0xC00" type="io" rw="RW"/>
          <memory-segment name="SDHC1" start="0x46000000" size="0xC00" type="io" rw="RW"/>
          <memory-segment name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW"/>
          
        </address-space>
        <address-space id="fuses" name="fuses" start="0x00000000" size="0x10000" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="GCLK_ID_TRACE" value="47"/>
        <param name="LITTLE_ENDIAN" value="1"/>
        <param name="NUM_IRQ" value="137"/>
        <param name="__CM4_REV" value="0x0001"/>
        <param name="__DEBUG_LVL" value="3"/>
        <param name="__FPU_PRESENT" value="1"/>
        <param name="__MPU_PRESENT" value="1"/>
        <param name="__NVIC_PRIO_BITS" value="3"/>
        <param name="__TRACE_LVL" value="2"/>
        <param name="__VTOR_PRESENT" value="1"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
      </parameters>
      <peripherals>
        <module name="AC" id="U2501" version="1.0.0">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x42002000"/>
            <signals>
              <signal group="AIN" index="0" function="B_AC" pad="PA04"/>
              <signal group="AIN" index="1" function="B_AC" pad="PA05"/>
              <signal group="AIN" index="2" function="B_AC" pad="PA06"/>
              <signal group="AIN" index="3" function="B_AC" pad="PA07"/>
              <signal group="CMP" index="0" function="M" pad="PA12"/>
              <signal group="CMP" index="0" function="M" pad="PA18"/>
              <signal group="CMP" index="0" function="M" pad="PB24"/>
              <signal group="CMP" index="1" function="M" pad="PA13"/>
              <signal group="CMP" index="1" function="M" pad="PA19"/>
              <signal group="CMP" index="1" function="M" pad="PB25"/>
            </signals>
            <parameters>
              <param name="COMPCTRL_MUXNEG_OPAMP" value="7"/>
              <param name="GCLK_ID" value="32"/>
              <param name="IMPLEMENTS_VDBLR" value="0"/>
              <param name="NUM_CMP" value="2"/>
              <param name="PAIRS" value="1"/>
              <param name="SPEED_LEVELS" value="2"/>
              <param name="INSTANCE_ID" value="72"/>
            </parameters>
          </instance>
        </module>
        <module name="ADC" id="U2500" version="1.0.0">
          <instance name="ADC0">
            <register-group name="ADC0" name-in-module="ADC" address-space="base" offset="0x43001C00"/>
            <signals>
              <signal group="AIN" index="0" function="B_ADC0" pad="PA02"/>
              <signal group="AIN" index="1" function="B_ADC0" pad="PA03"/>
              <signal group="AIN" index="2" function="B_ADC0" pad="PB08"/>
              <signal group="AIN" index="3" function="B_ADC0" pad="PB09"/>
              <signal group="AIN" index="4" function="B_ADC0" pad="PA04"/>
              <signal group="AIN" index="5" function="B_ADC0" pad="PA05"/>
              <signal group="AIN" index="6" function="B_ADC0" pad="PA06"/>
              <signal group="AIN" index="7" function="B_ADC0" pad="PA07"/>
              <signal group="AIN" index="8" function="B_ADC0" pad="PA08"/>
              <signal group="AIN" index="9" function="B_ADC0" pad="PA09"/>
              <signal group="AIN" index="10" function="B_ADC0" pad="PA10"/>
              <signal group="AIN" index="11" function="B_ADC0" pad="PA11"/>
              <signal group="AIN" index="12" function="B_ADC0" pad="PB00"/>
              <signal group="AIN" index="13" function="B_ADC0" pad="PB01"/>
              <signal group="AIN" index="14" function="B_ADC0" pad="PB02"/>
              <signal group="AIN" index="15" function="B_ADC0" pad="PB03"/>
              <signal group="DRV" index="0" function="O_PTC_DRV" pad="PA03"/>
              <signal group="DRV" index="1" function="O_PTC_DRV" pad="PB08"/>
              <signal group="DRV" index="2" function="O_PTC_DRV" pad="PB09"/>
              <signal group="DRV" index="3" function="O_PTC_DRV" pad="PA04"/>
              <signal group="DRV" index="4" function="O_PTC_DRV" pad="PA06"/>
              <signal group="DRV" index="5" function="O_PTC_DRV" pad="PA07"/>
              <signal group="DRV" index="6" function="O_PTC_DRV" pad="PA08"/>
              <signal group="DRV" index="7" function="O_PTC_DRV" pad="PA09"/>
              <signal group="DRV" index="8" function="O_PTC_DRV" pad="PA10"/>
              <signal group="DRV" index="9" function="O_PTC_DRV" pad="PA11"/>
              <signal group="DRV" index="10" function="O_PTC_DRV" pad="PA16"/>
              <signal group="DRV" index="11" function="O_PTC_DRV" pad="PA17"/>
              <signal group="DRV" index="12" function="O_PTC_DRV" pad="PA18"/>
              <signal group="DRV" index="13" function="O_PTC_DRV" pad="PA19"/>
              <signal group="DRV" index="14" function="O_PTC_DRV" pad="PA20"/>
              <signal group="DRV" index="15" function="O_PTC_DRV" pad="PA21"/>
              <signal group="DRV" index="16" function="O_PTC_DRV" pad="PA22"/>
              <signal group="DRV" index="17" function="O_PTC_DRV" pad="PA23"/>
              <signal group="DRV" index="18" function="O_PTC_DRV" pad="PA27"/>
              <signal group="DRV" index="19" function="O_PTC_DRV" pad="PA30"/>
              <signal group="DRV" index="20" function="O_PTC_DRV" pad="PB02"/>
              <signal group="DRV" index="21" function="O_PTC_DRV" pad="PB03"/>
              <signal group="DRV" index="22" function="O_PTC_DRV" pad="PB04"/>
              <signal group="DRV" index="23" function="O_PTC_DRV" pad="PB05"/>
              <signal group="DRV" index="24" function="O_PTC_DRV" pad="PB06"/>
              <signal group="DRV" index="25" function="O_PTC_DRV" pad="PB07"/>
              <signal group="DRV" index="26" function="O_PTC_DRV" pad="PB12"/>
              <signal group="DRV" index="27" function="O_PTC_DRV" pad="PB13"/>
              <signal group="DRV" index="28" function="O_PTC_DRV" pad="PB14"/>
              <signal group="DRV" index="29" function="O_PTC_DRV" pad="PB15"/>
              <signal group="DRV" index="30" function="O_PTC_DRV" pad="PB00"/>
              <signal group="DRV" index="31" function="O_PTC_DRV" pad="PB01"/>
              <signal group="X" index="0" function="B_PTC" pad="PA03"/>
              <signal group="Y" index="0" function="B_PTC" pad="PA03"/>
              <signal group="X" index="1" function="B_PTC" pad="PB08"/>
              <signal group="Y" index="1" function="B_PTC" pad="PB08"/>
              <signal group="X" index="2" function="B_PTC" pad="PB09"/>
              <signal group="Y" index="2" function="B_PTC" pad="PB09"/>
              <signal group="X" index="3" function="B_PTC" pad="PA04"/>
              <signal group="Y" index="3" function="B_PTC" pad="PA04"/>
              <signal group="X" index="4" function="B_PTC" pad="PA06"/>
              <signal group="Y" index="4" function="B_PTC" pad="PA06"/>
              <signal group="X" index="5" function="B_PTC" pad="PA07"/>
              <signal group="Y" index="5" function="B_PTC" pad="PA07"/>
              <signal group="X" index="6" function="B_PTC" pad="PA08"/>
              <signal group="Y" index="6" function="B_PTC" pad="PA08"/>
              <signal group="X" index="7" function="B_PTC" pad="PA09"/>
              <signal group="Y" index="7" function="B_PTC" pad="PA09"/>
              <signal group="X" index="8" function="B_PTC" pad="PA10"/>
              <signal group="Y" index="8" function="B_PTC" pad="PA10"/>
              <signal group="X" index="9" function="B_PTC" pad="PA11"/>
              <signal group="Y" index="9" function="B_PTC" pad="PA11"/>
              <signal group="X" index="10" function="B_PTC" pad="PA16"/>
              <signal group="Y" index="10" function="B_PTC" pad="PA16"/>
              <signal group="X" index="11" function="B_PTC" pad="PA17"/>
              <signal group="Y" index="11" function="B_PTC" pad="PA17"/>
              <signal group="X" index="13" function="B_PTC" pad="PA19"/>
              <signal group="Y" index="13" function="B_PTC" pad="PA19"/>
              <signal group="X" index="14" function="B_PTC" pad="PA20"/>
              <signal group="Y" index="14" function="B_PTC" pad="PA20"/>
              <signal group="X" index="15" function="B_PTC" pad="PA21"/>
              <signal group="Y" index="15" function="B_PTC" pad="PA21"/>
              <signal group="X" index="16" function="B_PTC" pad="PA22"/>
              <signal group="Y" index="16" function="B_PTC" pad="PA22"/>
              <signal group="X" index="17" function="B_PTC" pad="PA23"/>
              <signal group="Y" index="17" function="B_PTC" pad="PA23"/>
              <signal group="X" index="18" function="B_PTC" pad="PA27"/>
              <signal group="Y" index="18" function="B_PTC" pad="PA27"/>
              <signal group="X" index="19" function="B_PTC" pad="PA30"/>
              <signal group="Y" index="19" function="B_PTC" pad="PA30"/>
              <signal group="X" index="20" function="B_PTC" pad="PB02"/>
              <signal group="Y" index="20" function="B_PTC" pad="PB02"/>
              <signal group="X" index="21" function="B_PTC" pad="PB03"/>
              <signal group="Y" index="21" function="B_PTC" pad="PB03"/>
              <signal group="X" index="22" function="B_PTC" pad="PB04"/>
              <signal group="Y" index="22" function="B_PTC" pad="PB04"/>
              <signal group="X" index="23" function="B_PTC" pad="PB05"/>
              <signal group="Y" index="23" function="B_PTC" pad="PB05"/>
              <signal group="X" index="24" function="B_PTC" pad="PB06"/>
              <signal group="Y" index="24" function="B_PTC" pad="PB06"/>
              <signal group="X" index="25" function="B_PTC" pad="PB07"/>
              <signal group="Y" index="25" function="B_PTC" pad="PB07"/>
              <signal group="X" index="26" function="B_PTC" pad="PB12"/>
              <signal group="Y" index="26" function="B_PTC" pad="PB12"/>
              <signal group="X" index="27" function="B_PTC" pad="PB13"/>
              <signal group="Y" index="27" function="B_PTC" pad="PB13"/>
              <signal group="X" index="28" function="B_PTC" pad="PB14"/>
              <signal group="Y" index="28" function="B_PTC" pad="PB14"/>
              <signal group="X" index="29" function="B_PTC" pad="PB15"/>
              <signal group="Y" index="29" function="B_PTC" pad="PB15"/>
              <signal group="X" index="30" function="B_PTC" pad="PB00"/>
              <signal group="Y" index="30" function="B_PTC" pad="PB00"/>
              <signal group="X" index="31" function="B_PTC" pad="PB01"/>
              <signal group="Y" index="31" function="B_PTC" pad="PB01"/>
            </signals>
            <parameters>
              <param name="BANDGAP" value="27"/>
              <param name="CTAT" value="29"/>
              <param name="DMAC_ID_RESRDY" value="68"/>
              <param name="DMAC_ID_SEQ" value="69"/>
              <param name="EXTCHANNEL_MSB" value="15"/>
              <param name="GCLK_ID" value="40"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="OPAMP2" value="0"/>
              <param name="OPAMP01" value="0"/>
              <param name="PTAT" value="28"/>
              <param name="TOUCH_IMPLEMENTED" value="1"/>
              <param name="TOUCH_LINES_NUM" value="32"/>
              <param name="INSTANCE_ID" value="103"/>
            </parameters>
          </instance>
          <instance name="ADC1">
            <register-group name="ADC1" name-in-module="ADC" address-space="base" offset="0x43002000"/>
            <signals>
              <signal group="AIN" index="0" function="B_ADC1" pad="PB08"/>
              <signal group="AIN" index="1" function="B_ADC1" pad="PB09"/>
              <signal group="AIN" index="2" function="B_ADC1" pad="PA08"/>
              <signal group="AIN" index="3" function="B_ADC1" pad="PA09"/>
              <signal group="AIN" index="4" function="B_ADC1" pad="PC02"/>
              <signal group="AIN" index="5" function="B_ADC1" pad="PC03"/>
              <signal group="AIN" index="6" function="B_ADC1" pad="PB04"/>
              <signal group="AIN" index="7" function="B_ADC1" pad="PB05"/>
              <signal group="AIN" index="8" function="B_ADC1" pad="PB06"/>
              <signal group="AIN" index="9" function="B_ADC1" pad="PB07"/>
              <signal group="AIN" index="10" function="B_ADC1" pad="PC00"/>
              <signal group="AIN" index="11" function="B_ADC1" pad="PC01"/>
              <signal group="AIN" index="12" function="B_ADC1" pad="PC30"/>
              <signal group="AIN" index="13" function="B_ADC1" pad="PC31"/>
              <signal group="AIN" index="14" function="B_ADC1" pad="PD00"/>
              <signal group="AIN" index="15" function="B_ADC1" pad="PD01"/>
            </signals>
            <parameters>
              <param name="BANDGAP" value="27"/>
              <param name="CTAT" value="29"/>
              <param name="DMAC_ID_RESRDY" value="70"/>
              <param name="DMAC_ID_SEQ" value="71"/>
              <param name="EXTCHANNEL_MSB" value="15"/>
              <param name="GCLK_ID" value="41"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="OPAMP2" value="0"/>
              <param name="OPAMP01" value="0"/>
              <param name="PTAT" value="28"/>
              <param name="TOUCH_IMPLEMENTED" value="0"/>
              <param name="TOUCH_LINES_NUM" value="1"/>
              <param name="INSTANCE_ID" value="104"/>
            </parameters>
          </instance>
        </module>
        <module name="AES" id="U2238" version="2.2.0">
          <instance name="AES">
            <register-group name="AES" name-in-module="AES" address-space="base" offset="0x42002400"/>
            <parameters>
              <param name="DMAC_ID_RD" value="82"/>
              <param name="DMAC_ID_WR" value="81"/>
              <param name="FOUR_BYTE_OPERATION" value="1"/>
              <param name="GCM" value="1"/>
              <param name="KEYLEN" value="2"/>
              <param name="INSTANCE_ID" value="73"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="U2225" version="1.1.0">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x42003800"/>
            <signals>
              <signal group="IN" index="0" function="N" pad="PA04"/>
              <signal group="IN" index="0" function="N" pad="PA16"/>
              <signal group="IN" index="0" function="N" pad="PB22"/>
              <signal group="IN" index="1" function="N" pad="PA05"/>
              <signal group="IN" index="1" function="N" pad="PA17"/>
              <signal group="IN" index="1" function="N" pad="PB00"/>
              <signal group="IN" index="2" function="N" pad="PA06"/>
              <signal group="IN" index="2" function="N" pad="PA18"/>
              <signal group="IN" index="2" function="N" pad="PB01"/>
              <signal group="IN" index="3" function="N" pad="PA08"/>
              <signal group="IN" index="3" function="N" pad="PA30"/>
              <signal group="IN" index="4" function="N" pad="PA09"/>
              <signal group="IN" index="4" function="N" pad="PC27"/>
              <signal group="IN" index="5" function="N" pad="PA10"/>
              <signal group="IN" index="5" function="N" pad="PC28"/>
              <signal group="IN" index="6" function="N" pad="PA22"/>
              <signal group="IN" index="6" function="N" pad="PB06"/>
              <signal group="IN" index="7" function="N" pad="PA23"/>
              <signal group="IN" index="7" function="N" pad="PB07"/>
              <signal group="IN" index="8" function="N" pad="PA24"/>
              <signal group="IN" index="8" function="N" pad="PB08"/>
              <signal group="IN" index="9" function="N" pad="PB14"/>
              <signal group="IN" index="9" function="N" pad="PC20"/>
              <signal group="IN" index="10" function="N" pad="PB15"/>
              <signal group="IN" index="10" function="N" pad="PC21"/>
              <signal group="IN" index="11" function="N" pad="PB10"/>
              <signal group="IN" index="11" function="N" pad="PB16"/>
              <signal group="OUT" index="0" function="N" pad="PA07"/>
              <signal group="OUT" index="0" function="N" pad="PA19"/>
              <signal group="OUT" index="0" function="N" pad="PB02"/>
              <signal group="OUT" index="0" function="N" pad="PB23"/>
              <signal group="OUT" index="1" function="N" pad="PA11"/>
              <signal group="OUT" index="1" function="N" pad="PA31"/>
              <signal group="OUT" index="1" function="N" pad="PB11"/>
              <signal group="OUT" index="2" function="N" pad="PA25"/>
              <signal group="OUT" index="2" function="N" pad="PB09"/>
              <signal group="OUT" index="3" function="N" pad="PB17"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="33"/>
              <param name="LUT_NUM" value="4"/>
              <param name="SEQ_NUM" value="2"/>
              <param name="INSTANCE_ID" value="78"/>
            </parameters>
          </instance>
        </module>
        <module name="CMCC" id="U2015" version="6.0.0">
          <instance name="CMCC">
            <register-group name="CMCC" name-in-module="CMCC" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="INSTANCE_ID" value="35"/>
            </parameters>
          </instance>
        </module>
        <module name="DAC" id="U2502" version="1.0.0">
          <instance name="DAC">
            <register-group name="DAC" name-in-module="DAC" address-space="base" offset="0x43002400"/>
            <signals>
              <signal group="VOUT" index="0" function="B_DAC" pad="PA02"/>
              <signal group="VOUT" index="1" function="B_DAC" pad="PA05"/>
            </signals>
            <parameters>
              <param name="CHANNEL_SIZE" value="2"/>
              <param name="DATA_SIZE" value="12"/>
              <param name="GCLK_ID" value="42"/>
              <param name="STEP" value="7"/>
              <param name="INSTANCE_ID" value="105"/>
            </parameters>
          </instance>
        </module>
        <module name="DMAC" id="U2503" version="1.0.0">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x4100A000"/>
            <parameters>
              <param name="BURST" value="1"/>
              <param name="CH_BITS" value="5"/>
              <param name="CH_NUM" value="32"/>
              <param name="EVIN_NUM" value="8"/>
              <param name="EVOUT_NUM" value="4"/>
              <param name="FIFO_SIZE" value="16"/>
              <param name="LVL_BITS" value="2"/>
              <param name="LVL_NUM" value="4"/>
              <param name="QOSCTRL_D_RESETVALUE" value="2"/>
              <param name="QOSCTRL_F_RESETVALUE" value="2"/>
              <param name="QOSCTRL_WRB_RESETVALUE" value="2"/>
              <param name="TRIG_BITS" value="7"/>
              <param name="TRIG_NUM" value="85"/>
              <param name="INSTANCE_ID" value="37"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="U2410" version="1.0.0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41002000"/>
            <parameters>
              <param name="DMAC_ID_DCC0" value="2"/>
              <param name="DMAC_ID_DCC1" value="3"/>
              <param name="INSTANCE_ID" value="33"/>
            </parameters>
          </instance>
        </module>
