microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51P19A.atdf
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x41012000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA09"/>
              <signal group="PAD" index="0" function="D" pad="PB25"/>
              <signal group="PAD" index="0" function="C" pad="PA12"/>
              <signal group="PAD" index="0" function="C" pad="PB26"/>
              <signal group="PAD" index="1" function="D" pad="PA08"/>
              <signal group="PAD" index="1" function="D" pad="PB24"/>
              <signal group="PAD" index="1" function="C" pad="PA13"/>
              <signal group="PAD" index="1" function="C" pad="PB27"/>
              <signal group="PAD" index="2" function="D" pad="PA10"/>
              <signal group="PAD" index="2" function="D" pad="PC24"/>
              <signal group="PAD" index="2" function="C" pad="PB28"/>
              <signal group="PAD" index="2" function="C" pad="PA14"/>
              <signal group="PAD" index="3" function="D" pad="PA11"/>
              <signal group="PAD" index="3" function="D" pad="PC25"/>
              <signal group="PAD" index="3" function="C" pad="PB29"/>
              <signal group="PAD" index="3" function="C" pad="PA15"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1"/>
              <param name="DLY_COMPENSATION" value="1"/>
              <param name="DMA" value="1"/>
              <param name="DMAC_ID_RX" value="8"/>
              <param name="DMAC_ID_TX" value="9"/>
              <param name="FIFO_DEPTH_POWER" value="1"/>
              <param name="GCLK_ID_CORE" value="23"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0"/>
              <param name="SE_CNT" value="1"/>
              <param name="SPI" value="1"/>
              <param name="SPI_HW_SS_CTRL" value="1"/>
              <param name="SPI_ICSPACE_EXT" value="1"/>
              <param name="SPI_OZMO" value="0"/>
              <param name="SPI_WAKE_ON_SSL" value="1"/>
              <param name="TTBIT_EXTENSION" value="1"/>
              <param name="TWIM" value="1"/>
              <param name="TWIS" value="1"/>
              <param name="TWIS_AUTO_ACK" value="1"/>
              <param name="TWIS_GROUP_CMD" value="1"/>
              <param name="TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="TWIS_SDASETUP_SIZE" value="4"/>
              <param name="TWIS_SUDAT" value="1"/>
              <param name="TWI_FASTMP" value="1"/>
              <param name="TWI_HSMODE" value="1"/>
              <param name="TWI_SCLSM_MODE" value="1"/>
              <param name="TWI_SMB_TIMEOUTS" value="1"/>
              <param name="TWI_TENBIT_ADR" value="1"/>
              <param name="USART" value="1"/>
              <param name="USART_AUTOBAUD" value="1"/>
              <param name="USART_COLDET" value="1"/>
              <param name="USART_FLOW_CTRL" value="1"/>
              <param name="USART_FRAC_BAUD" value="1"/>
              <param name="USART_IRDA" value="1"/>
              <param name="USART_ISO7816" value="1"/>
              <param name="USART_LIN_MASTER" value="1"/>
              <param name="USART_RS485" value="1"/>
              <param name="USART_SAMPA_EXT" value="1"/>
              <param name="USART_SAMPR_EXT" value="1"/>
              <param name="INSTANCE_ID" value="41"/>
            </parameters>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x41014000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA17"/>
              <signal group="PAD" index="0" function="D" pad="PC23"/>
              <signal group="PAD" index="0" function="C" pad="PA22"/>
              <signal group="PAD" index="0" function="C" pad="PB20"/>
              <signal group="PAD" index="1" function="D" pad="PA16"/>
              <signal group="PAD" index="1" function="D" pad="PC22"/>
              <signal group="PAD" index="1" function="C" pad="PA23"/>
              <signal group="PAD" index="1" function="C" pad="PB21"/>
              <signal group="PAD" index="2" function="D" pad="PA18"/>
              <signal group="PAD" index="2" function="D" pad="PA20"/>
              <signal group="PAD" index="2" function="D" pad="PD20"/>
              <signal group="PAD" index="2" function="C" pad="PA24"/>
              <signal group="PAD" index="3" function="D" pad="PA19"/>
              <signal group="PAD" index="3" function="D" pad="PA21"/>
              <signal group="PAD" index="3" function="D" pad="PD21"/>
              <signal group="PAD" index="3" function="C" pad="PA25"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1"/>
              <param name="DLY_COMPENSATION" value="1"/>
              <param name="DMA" value="1"/>
              <param name="DMAC_ID_RX" value="10"/>
              <param name="DMAC_ID_TX" value="11"/>
              <param name="FIFO_DEPTH_POWER" value="1"/>
              <param name="GCLK_ID_CORE" value="24"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0"/>
              <param name="SE_CNT" value="1"/>
              <param name="SPI" value="1"/>
              <param name="SPI_HW_SS_CTRL" value="1"/>
              <param name="SPI_ICSPACE_EXT" value="1"/>
              <param name="SPI_OZMO" value="0"/>
              <param name="SPI_WAKE_ON_SSL" value="1"/>
              <param name="TTBIT_EXTENSION" value="1"/>
              <param name="TWIM" value="1"/>
              <param name="TWIS" value="1"/>
              <param name="TWIS_AUTO_ACK" value="1"/>
              <param name="TWIS_GROUP_CMD" value="1"/>
              <param name="TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="TWIS_SDASETUP_SIZE" value="4"/>
              <param name="TWIS_SUDAT" value="1"/>
              <param name="TWI_FASTMP" value="1"/>
              <param name="TWI_HSMODE" value="1"/>
              <param name="TWI_SCLSM_MODE" value="1"/>
              <param name="TWI_SMB_TIMEOUTS" value="1"/>
              <param name="TWI_TENBIT_ADR" value="1"/>
              <param name="USART" value="1"/>
              <param name="USART_AUTOBAUD" value="1"/>
              <param name="USART_COLDET" value="1"/>
              <param name="USART_FLOW_CTRL" value="1"/>
              <param name="USART_FRAC_BAUD" value="1"/>
              <param name="USART_IRDA" value="1"/>
              <param name="USART_ISO7816" value="1"/>
              <param name="USART_LIN_MASTER" value="1"/>
              <param name="USART_RS485" value="1"/>
              <param name="USART_SAMPA_EXT" value="1"/>
              <param name="USART_SAMPR_EXT" value="1"/>
              <param name="INSTANCE_ID" value="42"/>
            </parameters>
          </instance>
          <instance name="SERCOM4">
            <register-group name="SERCOM4" name-in-module="SERCOM" address-space="base" offset="0x43000000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA13"/>
              <signal group="PAD" index="0" function="D" pad="PB08"/>
              <signal group="PAD" index="0" function="D" pad="PB27"/>
              <signal group="PAD" index="0" function="C" pad="PB12"/>
              <signal group="PAD" index="1" function="D" pad="PA12"/>
              <signal group="PAD" index="1" function="D" pad="PB09"/>
              <signal group="PAD" index="1" function="D" pad="PB26"/>
              <signal group="PAD" index="1" function="C" pad="PB13"/>
              <signal group="PAD" index="2" function="D" pad="PA14"/>
              <signal group="PAD" index="2" function="D" pad="PB10"/>
              <signal group="PAD" index="2" function="D" pad="PB28"/>
              <signal group="PAD" index="2" function="C" pad="PB14"/>
              <signal group="PAD" index="3" function="D" pad="PB11"/>
              <signal group="PAD" index="3" function="D" pad="PB29"/>
              <signal group="PAD" index="3" function="D" pad="PA15"/>
              <signal group="PAD" index="3" function="C" pad="PB15"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1"/>
              <param name="DLY_COMPENSATION" value="1"/>
              <param name="DMA" value="1"/>
              <param name="DMAC_ID_RX" value="12"/>
              <param name="DMAC_ID_TX" value="13"/>
              <param name="FIFO_DEPTH_POWER" value="1"/>
              <param name="GCLK_ID_CORE" value="34"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0"/>
              <param name="SE_CNT" value="1"/>
              <param name="SPI" value="1"/>
              <param name="SPI_HW_SS_CTRL" value="1"/>
              <param name="SPI_ICSPACE_EXT" value="1"/>
              <param name="SPI_OZMO" value="0"/>
              <param name="SPI_WAKE_ON_SSL" value="1"/>
              <param name="TTBIT_EXTENSION" value="1"/>
              <param name="TWIM" value="1"/>
              <param name="TWIS" value="1"/>
              <param name="TWIS_AUTO_ACK" value="1"/>
              <param name="TWIS_GROUP_CMD" value="1"/>
              <param name="TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="TWIS_SDASETUP_SIZE" value="4"/>
              <param name="TWIS_SUDAT" value="1"/>
              <param name="TWI_FASTMP" value="1"/>
              <param name="TWI_HSMODE" value="1"/>
              <param name="TWI_SCLSM_MODE" value="1"/>
              <param name="TWI_SMB_TIMEOUTS" value="1"/>
              <param name="TWI_TENBIT_ADR" value="1"/>
              <param name="USART" value="1"/>
              <param name="USART_AUTOBAUD" value="1"/>
              <param name="USART_COLDET" value="1"/>
              <param name="USART_FLOW_CTRL" value="1"/>
              <param name="USART_FRAC_BAUD" value="1"/>
              <param name="USART_IRDA" value="1"/>
              <param name="USART_ISO7816" value="1"/>
              <param name="USART_LIN_MASTER" value="1"/>
              <param name="USART_RS485" value="1"/>
              <param name="USART_SAMPA_EXT" value="1"/>
              <param name="USART_SAMPR_EXT" value="1"/>
              <param name="INSTANCE_ID" value="96"/>
            </parameters>
          </instance>
          <instance name="SERCOM5">
            <register-group name="SERCOM5" name-in-module="SERCOM" address-space="base" offset="0x43000400"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA23"/>
              <signal group="PAD" index="0" function="D" pad="PB02"/>
              <signal group="PAD" index="0" function="D" pad="PB31"/>
              <signal group="PAD" index="0" function="C" pad="PB16"/>
              <signal group="PAD" index="1" function="D" pad="PA22"/>
              <signal group="PAD" index="1" function="D" pad="PB03"/>
              <signal group="PAD" index="1" function="D" pad="PB30"/>
              <signal group="PAD" index="1" function="C" pad="PB17"/>
              <signal group="PAD" index="2" function="D" pad="PA24"/>
              <signal group="PAD" index="2" function="D" pad="PB00"/>
              <signal group="PAD" index="2" function="D" pad="PB22"/>
              <signal group="PAD" index="2" function="C" pad="PA20"/>
              <signal group="PAD" index="2" function="C" pad="PB18"/>
              <signal group="PAD" index="3" function="D" pad="PA25"/>
              <signal group="PAD" index="3" function="D" pad="PB01"/>
              <signal group="PAD" index="3" function="D" pad="PB23"/>
              <signal group="PAD" index="3" function="C" pad="PA21"/>
              <signal group="PAD" index="3" function="C" pad="PB19"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1"/>
              <param name="DLY_COMPENSATION" value="1"/>
              <param name="DMA" value="1"/>
              <param name="DMAC_ID_RX" value="14"/>
              <param name="DMAC_ID_TX" value="15"/>
              <param name="FIFO_DEPTH_POWER" value="1"/>
              <param name="GCLK_ID_CORE" value="35"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0"/>
              <param name="SE_CNT" value="1"/>
              <param name="SPI" value="1"/>
              <param name="SPI_HW_SS_CTRL" value="1"/>
              <param name="SPI_ICSPACE_EXT" value="1"/>
              <param name="SPI_OZMO" value="0"/>
              <param name="SPI_WAKE_ON_SSL" value="1"/>
              <param name="TTBIT_EXTENSION" value="1"/>
              <param name="TWIM" value="1"/>
              <param name="TWIS" value="1"/>
              <param name="TWIS_AUTO_ACK" value="1"/>
              <param name="TWIS_GROUP_CMD" value="1"/>
              <param name="TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="TWIS_SDASETUP_SIZE" value="4"/>
              <param name="TWIS_SUDAT" value="1"/>
              <param name="TWI_FASTMP" value="1"/>
              <param name="TWI_HSMODE" value="1"/>
              <param name="TWI_SCLSM_MODE" value="1"/>
              <param name="TWI_SMB_TIMEOUTS" value="1"/>
              <param name="TWI_TENBIT_ADR" value="1"/>
              <param name="USART" value="1"/>
              <param name="USART_AUTOBAUD" value="1"/>
              <param name="USART_COLDET" value="1"/>
              <param name="USART_FLOW_CTRL" value="1"/>
              <param name="USART_FRAC_BAUD" value="1"/>
              <param name="USART_IRDA" value="1"/>
              <param name="USART_ISO7816" value="1"/>
              <param name="USART_LIN_MASTER" value="1"/>
              <param name="USART_RS485" value="1"/>
              <param name="USART_SAMPA_EXT" value="1"/>
              <param name="USART_SAMPR_EXT" value="1"/>
              <param name="INSTANCE_ID" value="97"/>
            </parameters>
          </instance>
