microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51P19A.atdf
          <instance name="SERCOM6">
            <register-group name="SERCOM6" name-in-module="SERCOM" address-space="base" offset="0x43000800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PD09"/>
              <signal group="PAD" index="0" function="D" pad="PC13"/>
              <signal group="PAD" index="0" function="C" pad="PC04"/>
              <signal group="PAD" index="0" function="C" pad="PC16"/>
              <signal group="PAD" index="1" function="D" pad="PD08"/>
              <signal group="PAD" index="1" function="D" pad="PC12"/>
              <signal group="PAD" index="1" function="C" pad="PC05"/>
              <signal group="PAD" index="1" function="C" pad="PC17"/>
              <signal group="PAD" index="2" function="D" pad="PC14"/>
              <signal group="PAD" index="2" function="D" pad="PD10"/>
              <signal group="PAD" index="2" function="C" pad="PC06"/>
              <signal group="PAD" index="2" function="C" pad="PC10"/>
              <signal group="PAD" index="2" function="C" pad="PC18"/>
              <signal group="PAD" index="3" function="D" pad="PC15"/>
              <signal group="PAD" index="3" function="D" pad="PD11"/>
              <signal group="PAD" index="3" function="C" pad="PC07"/>
              <signal group="PAD" index="3" function="C" pad="PC11"/>
              <signal group="PAD" index="3" function="C" pad="PC19"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1"/>
              <param name="DLY_COMPENSATION" value="1"/>
              <param name="DMA" value="1"/>
              <param name="DMAC_ID_RX" value="16"/>
              <param name="DMAC_ID_TX" value="17"/>
              <param name="FIFO_DEPTH_POWER" value="1"/>
              <param name="GCLK_ID_CORE" value="36"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0"/>
              <param name="SE_CNT" value="1"/>
              <param name="SPI" value="1"/>
              <param name="SPI_HW_SS_CTRL" value="1"/>
              <param name="SPI_ICSPACE_EXT" value="1"/>
              <param name="SPI_OZMO" value="0"/>
              <param name="SPI_WAKE_ON_SSL" value="1"/>
              <param name="TTBIT_EXTENSION" value="1"/>
              <param name="TWIM" value="1"/>
              <param name="TWIS" value="1"/>
              <param name="TWIS_AUTO_ACK" value="1"/>
              <param name="TWIS_GROUP_CMD" value="1"/>
              <param name="TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="TWIS_SDASETUP_SIZE" value="4"/>
              <param name="TWIS_SUDAT" value="1"/>
              <param name="TWI_FASTMP" value="1"/>
              <param name="TWI_HSMODE" value="1"/>
              <param name="TWI_SCLSM_MODE" value="1"/>
              <param name="TWI_SMB_TIMEOUTS" value="1"/>
              <param name="TWI_TENBIT_ADR" value="1"/>
              <param name="USART" value="1"/>
              <param name="USART_AUTOBAUD" value="1"/>
              <param name="USART_COLDET" value="1"/>
              <param name="USART_FLOW_CTRL" value="1"/>
              <param name="USART_FRAC_BAUD" value="1"/>
              <param name="USART_IRDA" value="1"/>
              <param name="USART_ISO7816" value="1"/>
              <param name="USART_LIN_MASTER" value="1"/>
              <param name="USART_RS485" value="1"/>
              <param name="USART_SAMPA_EXT" value="1"/>
              <param name="USART_SAMPR_EXT" value="1"/>
              <param name="INSTANCE_ID" value="98"/>
            </parameters>
          </instance>
          <instance name="SERCOM7">
            <register-group name="SERCOM7" name-in-module="SERCOM" address-space="base" offset="0x43000C00"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PB21"/>
              <signal group="PAD" index="0" function="C" pad="PD08"/>
              <signal group="PAD" index="0" function="C" pad="PB30"/>
              <signal group="PAD" index="0" function="C" pad="PC12"/>
              <signal group="PAD" index="1" function="D" pad="PB20"/>
              <signal group="PAD" index="1" function="C" pad="PD09"/>
              <signal group="PAD" index="1" function="C" pad="PB31"/>
              <signal group="PAD" index="1" function="C" pad="PC13"/>
              <signal group="PAD" index="2" function="D" pad="PB18"/>
              <signal group="PAD" index="2" function="D" pad="PC10"/>
              <signal group="PAD" index="2" function="C" pad="PC14"/>
              <signal group="PAD" index="2" function="C" pad="PD10"/>
              <signal group="PAD" index="2" function="C" pad="PA30"/>
              <signal group="PAD" index="3" function="D" pad="PB19"/>
              <signal group="PAD" index="3" function="D" pad="PC11"/>
              <signal group="PAD" index="3" function="C" pad="PC15"/>
              <signal group="PAD" index="3" function="C" pad="PD11"/>
              <signal group="PAD" index="3" function="C" pad="PA31"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1"/>
              <param name="DLY_COMPENSATION" value="1"/>
              <param name="DMA" value="1"/>
              <param name="DMAC_ID_RX" value="18"/>
              <param name="DMAC_ID_TX" value="19"/>
              <param name="FIFO_DEPTH_POWER" value="1"/>
              <param name="GCLK_ID_CORE" value="37"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0"/>
              <param name="SE_CNT" value="1"/>
              <param name="SPI" value="1"/>
              <param name="SPI_HW_SS_CTRL" value="1"/>
              <param name="SPI_ICSPACE_EXT" value="1"/>
              <param name="SPI_OZMO" value="0"/>
              <param name="SPI_WAKE_ON_SSL" value="1"/>
              <param name="TTBIT_EXTENSION" value="1"/>
              <param name="TWIM" value="1"/>
              <param name="TWIS" value="1"/>
              <param name="TWIS_AUTO_ACK" value="1"/>
              <param name="TWIS_GROUP_CMD" value="1"/>
              <param name="TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="TWIS_SDASETUP_SIZE" value="4"/>
              <param name="TWIS_SUDAT" value="1"/>
              <param name="TWI_FASTMP" value="1"/>
              <param name="TWI_HSMODE" value="1"/>
              <param name="TWI_SCLSM_MODE" value="1"/>
              <param name="TWI_SMB_TIMEOUTS" value="1"/>
              <param name="TWI_TENBIT_ADR" value="1"/>
              <param name="USART" value="1"/>
              <param name="USART_AUTOBAUD" value="1"/>
              <param name="USART_COLDET" value="1"/>
              <param name="USART_FLOW_CTRL" value="1"/>
              <param name="USART_FRAC_BAUD" value="1"/>
              <param name="USART_IRDA" value="1"/>
              <param name="USART_ISO7816" value="1"/>
              <param name="USART_LIN_MASTER" value="1"/>
              <param name="USART_RS485" value="1"/>
              <param name="USART_SAMPA_EXT" value="1"/>
              <param name="USART_SAMPR_EXT" value="1"/>
              <param name="INSTANCE_ID" value="99"/>
            </parameters>
          </instance>
        </module>
