microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51P19A.atdf
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA14"/>
              <signal group="WO" index="0" function="F" pad="PA30"/>
              <signal group="WO" index="1" function="F" pad="PA15"/>
              <signal group="WO" index="1" function="F" pad="PA31"/>
              <signal group="WO" index="2" function="F" pad="PA24"/>
              <signal group="WO" index="2" function="F" pad="PB02"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="3"/>
              <param name="DITHERING" value="0"/>
              <param name="DMAC_ID_OVF" value="34"/>
              <param name="DTI" value="0"/>
              <param name="EXT" value="1"/>
              <param name="GCLK_ID" value="29"/>
              <param name="MASTER_SLAVE_MODE" value="0"/>
              <param name="OTMX" value="1"/>
              <param name="OW_NUM" value="3"/>
              <param name="PG" value="0"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
          </instance>
          <instance name="TCC3">
            <register-group name="TCC3" name-in-module="TCC" address-space="base" offset="0x42001000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PB12"/>
              <signal group="WO" index="0" function="F" pad="PB16"/>
              <signal group="WO" index="1" function="F" pad="PB13"/>
              <signal group="WO" index="1" function="F" pad="PB17"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DITHERING" value="0"/>
              <param name="DMAC_ID_OVF" value="38"/>
              <param name="DTI" value="0"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="29"/>
              <param name="MASTER_SLAVE_MODE" value="0"/>
              <param name="OTMX" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PG" value="0"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0"/>
              <param name="INSTANCE_ID" value="68"/>
            </parameters>
          </instance>
          <instance name="TCC4">
            <register-group name="TCC4" name-in-module="TCC" address-space="base" offset="0x43001000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PB14"/>
              <signal group="WO" index="0" function="F" pad="PB30"/>
              <signal group="WO" index="1" function="F" pad="PB15"/>
              <signal group="WO" index="1" function="F" pad="PB31"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DITHERING" value="0"/>
              <param name="DMAC_ID_OVF" value="41"/>
              <param name="DTI" value="0"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="38"/>
              <param name="MASTER_SLAVE_MODE" value="0"/>
              <param name="OTMX" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PG" value="0"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0"/>
              <param name="INSTANCE_ID" value="100"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="U2242" version="1.1.0">
          <instance name="TRNG">
            <register-group name="TRNG" name-in-module="TRNG" address-space="base" offset="0x42002800"/>
            <parameters>
              <param name="INSTANCE_ID" value="74"/>
            </parameters>
          </instance>
        </module>
        <module name="USB" id="U2222" version="1.2.0">
          <instance name="USB">
            <register-group name="USB" name-in-module="USB" address-space="base" offset="0x41000000"/>
            <signals>
              <signal group="DM" function="H" pad="PA24"/>
              <signal group="DP" function="H" pad="PA25"/>
              <signal group="SOF_1KHZ" function="H" pad="PA23"/>
              <signal group="SOF_1KHZ" function="H" pad="PB22"/>
            </signals>
            <parameters>
              <param name="AHB_2_USB_FIFO_DEPTH" value="4"/>
              <param name="AHB_2_USB_RD_DATA_BITS" value="8"/>
              <param name="AHB_2_USB_WR_DATA_BITS" value="32"/>
              <param name="AHB_2_USB_WR_THRESHOLD" value="2"/>
              <param name="DATA_BUS_16_8" value="0"/>
              <param name="EPNUM" value="8"/>
              <param name="EPT_NUM" value="8"/>
              <param name="GCLK_ID" value="10"/>
              <param name="INITIAL_CONTROL_QOS" value="3"/>
              <param name="INITIAL_DATA_QOS" value="3"/>
              <param name="MISSING_SOF_DET_IMPLEMENTED" value="1"/>
              <param name="PIPE_NUM" value="8"/>
              <param name="SYSTEM_CLOCK_IS_CKUSB" value="0"/>
              <param name="USB_2_AHB_FIFO_DEPTH" value="4"/>
              <param name="USB_2_AHB_RD_DATA_BITS" value="16"/>
              <param name="USB_2_AHB_RD_THRESHOLD" value="2"/>
              <param name="USB_2_AHB_WR_DATA_BITS" value="8"/>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2251" version="1.1.0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8"/>
            </parameters>
          </instance>
        </module>
      <module name="SystemControl">
            <instance name="SystemControl">
                <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
