microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51P19A.atdf
        <register name="DATA" offset="0x10" rw="W" access="WSYNC" size="2" count="2" initval="0x0000" caption="DAC n Data">
          <bitfield name="DATA" caption="DAC0 Data" mask="0xFFFF"/>
        </register>
        <register name="DATABUF" offset="0x14" rw="W" access="WSYNC" size="2" count="2" initval="0x0000" caption="DAC n Data Buffer">
          <bitfield name="DATABUF" caption="DAC0 Data Buffer" mask="0xFFFF"/>
        </register>
        <register name="DBGCTRL" offset="0x18" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="RESULT" offset="0x1C" rw="R" size="2" count="2" initval="0x0000" caption="Filter Result">
          <bitfield name="RESULT" caption="Filter Result" mask="0xFFFF"/>
        </register>
      </register-group>
      <value-group name="DAC_CTRLB__REFSEL">
        <value name="VREFPU" caption="External reference unbuffered" value="0"/>
        <value name="VDDANA" caption="Analog supply" value="1"/>
        <value name="VREFPB" caption="External reference buffered" value="2"/>
        <value name="INTREF" caption="Internal bandgap reference" value="3"/>
      </value-group>
      <value-group name="DAC_DACCTRL__CCTRL">
        <value name="CC100K" caption="GCLK_DAC &lt;= 1.2MHz (100kSPS)" value="0x0"/>
        <value name="CC1M" caption="1.2MHz &lt; GCLK_DAC  &lt;= 6MHz (500kSPS)" value="0x1"/>
        <value name="CC12M" caption="6MHz &lt; GCLK_DAC &lt;= 12MHz (1MSPS)" value="0x2"/>
      </value-group>
    </module>
    <module name="DMAC" id="U2503" version="1.0.0" caption="Direct Memory Access Controller">
      <register-group name="CHANNEL" size="0x10">
        <register name="CHCTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Channel n Control A">
          <bitfield name="SWRST" caption="Channel Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Channel Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Channel Run in Standby" mask="0x40"/>
          <bitfield name="TRIGSRC" caption="Trigger Source" mask="0x7F00" values="DMAC_CHCTRLA__TRIGSRC"/>
          <bitfield name="TRIGACT" caption="Trigger Action" mask="0x300000" values="DMAC_CHCTRLA__TRIGACT"/>
          <bitfield name="BURSTLEN" caption="Burst Length" mask="0xF000000" values="DMAC_CHCTRLA__BURSTLEN"/>
          <bitfield name="THRESHOLD" caption="FIFO Threshold" mask="0x30000000" values="DMAC_CHCTRLA__THRESHOLD"/>
        </register>
        <register name="CHCTRLB" offset="0x4" rw="RW" size="1" initval="0x00" caption="Channel n Control B">
          <bitfield name="CMD" caption="Software Command" mask="0x3" values="DMAC_CHCTRLB__CMD"/>
        </register>
        <register name="CHPRILVL" offset="0x5" rw="RW" size="1" initval="0x00" caption="Channel n Priority Level">
          <bitfield name="PRILVL" caption="Channel Priority Level" mask="0x3" values="DMAC_CHPRILVL__PRILVL"/>
        </register>
        <register name="CHEVCTRL" offset="0x6" rw="RW" size="1" initval="0x00" caption="Channel n Event Control">
          <bitfield name="EVACT" caption="Channel Event Input Action" mask="0x7" values="DMAC_CHEVCTRL__EVACT"/>
          <bitfield name="EVOMODE" caption="Channel Event Output Mode" mask="0x30" values="DMAC_CHEVCTRL__EVOMODE"/>
          <bitfield name="EVIE" caption="Channel Event Input Enable" mask="0x40"/>
          <bitfield name="EVOE" caption="Channel Event Output Enable" mask="0x80"/>
        </register>
        <register name="CHINTENCLR" offset="0xC" rw="RW" size="1" atomic-op="clear:CHINTENCLR" initval="0x00" caption="Channel n Interrupt Enable Clear">
          <bitfield name="TERR" caption="Channel Transfer Error Interrupt Enable" mask="0x1"/>
          <bitfield name="TCMPL" caption="Channel Transfer Complete Interrupt Enable" mask="0x2"/>
          <bitfield name="SUSP" caption="Channel Suspend Interrupt Enable" mask="0x4"/>
        </register>
        <register name="CHINTENSET" offset="0xD" rw="RW" size="1" atomic-op="set:CHINTENSET" initval="0x00" caption="Channel n Interrupt Enable Set">
          <bitfield name="TERR" caption="Channel Transfer Error Interrupt Enable" mask="0x1"/>
          <bitfield name="TCMPL" caption="Channel Transfer Complete Interrupt Enable" mask="0x2"/>
          <bitfield name="SUSP" caption="Channel Suspend Interrupt Enable" mask="0x4"/>
        </register>
        <register name="CHINTFLAG" offset="0xE" rw="RW" size="1" atomic-op="clear:CHINTFLAG" initval="0x00" caption="Channel n Interrupt Flag Status and Clear">
          <bitfield name="TERR" caption="Channel Transfer Error" mask="0x1"/>
          <bitfield name="TCMPL" caption="Channel Transfer Complete" mask="0x2"/>
          <bitfield name="SUSP" caption="Channel Suspend" mask="0x4"/>
        </register>
        <register name="CHSTATUS" offset="0xF" rw="RW" size="1" initval="0x00" caption="Channel n Status">
          <bitfield name="PEND" caption="Channel Pending" mask="0x1"/>
          <bitfield name="BUSY" caption="Channel Busy" mask="0x2"/>
          <bitfield name="FERR" caption="Channel Fetch Error" mask="0x4"/>
          <bitfield name="CRCERR" caption="Channel CRC Error" mask="0x8"/>
        </register>
      </register-group>
      <register-group name="DMAC" caption="Direct Memory Access Controller">
        <register name="CTRL" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="DMAENABLE" caption="DMA Enable" mask="0x2"/>
          <bitfield name="LVLEN0" caption="Priority Level 0 Enable" mask="0x100"/>
          <bitfield name="LVLEN1" caption="Priority Level 1 Enable" mask="0x200"/>
          <bitfield name="LVLEN2" caption="Priority Level 2 Enable" mask="0x400"/>
          <bitfield name="LVLEN3" caption="Priority Level 3 Enable" mask="0x800"/>
        </register>
        <register name="CRCCTRL" offset="0x2" rw="RW" size="2" initval="0x0000" caption="CRC Control">
          <bitfield name="CRCBEATSIZE" caption="CRC Beat Size" mask="0x3" values="DMAC_CRCCTRL__CRCBEATSIZE"/>
          <bitfield name="CRCPOLY" caption="CRC Polynomial Type" mask="0xC" values="DMAC_CRCCTRL__CRCPOLY"/>
          <bitfield name="CRCSRC" caption="CRC Input Source" mask="0x3F00" values="DMAC_CRCCTRL__CRCSRC"/>
          <bitfield name="CRCMODE" caption="CRC Operating Mode" mask="0xC000" values="DMAC_CRCCTRL__CRCMODE"/>
        </register>
        <register name="CRCDATAIN" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CRC Data Input">
          <bitfield name="CRCDATAIN" caption="CRC Data Input" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCCHKSUM" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="CRC Checksum">
          <bitfield name="CRCCHKSUM" caption="CRC Checksum" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCSTATUS" offset="0xC" rw="RW" size="1" initval="0x00" caption="CRC Status">
          <bitfield name="CRCBUSY" caption="CRC Module Busy" mask="0x1"/>
          <bitfield name="CRCZERO" caption="CRC Zero" mask="0x2"/>
          <bitfield name="CRCERR" caption="CRC Error" mask="0x4"/>
        </register>
        <register name="DBGCTRL" offset="0xD" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="SWTRIGCTRL" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Software Trigger Control">
          <bitfield name="SWTRIG0" caption="Channel 0 Software Trigger" mask="0x1"/>
          <bitfield name="SWTRIG1" caption="Channel 1 Software Trigger" mask="0x2"/>
          <bitfield name="SWTRIG2" caption="Channel 2 Software Trigger" mask="0x4"/>
          <bitfield name="SWTRIG3" caption="Channel 3 Software Trigger" mask="0x8"/>
          <bitfield name="SWTRIG4" caption="Channel 4 Software Trigger" mask="0x10"/>
          <bitfield name="SWTRIG5" caption="Channel 5 Software Trigger" mask="0x20"/>
          <bitfield name="SWTRIG6" caption="Channel 6 Software Trigger" mask="0x40"/>
          <bitfield name="SWTRIG7" caption="Channel 7 Software Trigger" mask="0x80"/>
          <bitfield name="SWTRIG8" caption="Channel 8 Software Trigger" mask="0x100"/>
          <bitfield name="SWTRIG9" caption="Channel 9 Software Trigger" mask="0x200"/>
          <bitfield name="SWTRIG10" caption="Channel 10 Software Trigger" mask="0x400"/>
          <bitfield name="SWTRIG11" caption="Channel 11 Software Trigger" mask="0x800"/>
          <bitfield name="SWTRIG12" caption="Channel 12 Software Trigger" mask="0x1000"/>
          <bitfield name="SWTRIG13" caption="Channel 13 Software Trigger" mask="0x2000"/>
          <bitfield name="SWTRIG14" caption="Channel 14 Software Trigger" mask="0x4000"/>
          <bitfield name="SWTRIG15" caption="Channel 15 Software Trigger" mask="0x8000"/>
          <bitfield name="SWTRIG16" caption="Channel 16 Software Trigger" mask="0x10000"/>
          <bitfield name="SWTRIG17" caption="Channel 17 Software Trigger" mask="0x20000"/>
          <bitfield name="SWTRIG18" caption="Channel 18 Software Trigger" mask="0x40000"/>
          <bitfield name="SWTRIG19" caption="Channel 19 Software Trigger" mask="0x80000"/>
          <bitfield name="SWTRIG20" caption="Channel 20 Software Trigger" mask="0x100000"/>
          <bitfield name="SWTRIG21" caption="Channel 21 Software Trigger" mask="0x200000"/>
          <bitfield name="SWTRIG22" caption="Channel 22 Software Trigger" mask="0x400000"/>
          <bitfield name="SWTRIG23" caption="Channel 23 Software Trigger" mask="0x800000"/>
          <bitfield name="SWTRIG24" caption="Channel 24 Software Trigger" mask="0x1000000"/>
          <bitfield name="SWTRIG25" caption="Channel 25 Software Trigger" mask="0x2000000"/>
          <bitfield name="SWTRIG26" caption="Channel 26 Software Trigger" mask="0x4000000"/>
          <bitfield name="SWTRIG27" caption="Channel 27 Software Trigger" mask="0x8000000"/>
          <bitfield name="SWTRIG28" caption="Channel 28 Software Trigger" mask="0x10000000"/>
          <bitfield name="SWTRIG29" caption="Channel 29 Software Trigger" mask="0x20000000"/>
          <bitfield name="SWTRIG30" caption="Channel 30 Software Trigger" mask="0x40000000"/>
          <bitfield name="SWTRIG31" caption="Channel 31 Software Trigger" mask="0x80000000"/>
        </register>
