microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51P19A.atdf
        <register name="DFLLCTRLB" offset="0x20" rw="RW" access="RSYNC" size="1" initval="0x00" caption="DFLL48M Control B">
          <bitfield name="MODE" caption="Operating Mode Selection" mask="0x1"/>
          <bitfield name="STABLE" caption="Stable DFLL Frequency" mask="0x2"/>
          <bitfield name="LLAW" caption="Lose Lock After Wake" mask="0x4"/>
          <bitfield name="USBCRM" caption="USB Clock Recovery Mode" mask="0x8"/>
          <bitfield name="CCDIS" caption="Chill Cycle Disable" mask="0x10"/>
          <bitfield name="QLDIS" caption="Quick Lock Disable" mask="0x20"/>
          <bitfield name="BPLCKC" caption="Bypass Coarse Lock" mask="0x40"/>
          <bitfield name="WAITLOCK" caption="Wait Lock" mask="0x80"/>
        </register>
        <register name="DFLLVAL" offset="0x24" rw="RW" access="RWSYNC" size="4" initval="0x00000000" caption="DFLL48M Value">
          <bitfield name="FINE" caption="Fine Value" mask="0xFF"/>
          <bitfield name="COARSE" caption="Coarse Value" mask="0xFC00"/>
          <bitfield name="DIFF" caption="Multiplication Ratio Difference" mask="0xFFFF0000"/>
        </register>
        <register name="DFLLMUL" offset="0x28" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="DFLL48M Multiplier">
          <bitfield name="MUL" caption="DFLL Multiply Factor" mask="0xFFFF"/>
          <bitfield name="FSTEP" caption="Fine Maximum Step" mask="0xFF0000"/>
          <bitfield name="CSTEP" caption="Coarse Maximum Step" mask="0xFC000000"/>
        </register>
        <register name="DFLLSYNC" offset="0x2C" rw="RW" size="1" initval="0x00" caption="DFLL48M Synchronization">
          <bitfield name="ENABLE" caption="ENABLE Synchronization Busy" mask="0x2"/>
          <bitfield name="DFLLCTRLB" caption="DFLLCTRLB Synchronization Busy" mask="0x4"/>
          <bitfield name="DFLLVAL" caption="DFLLVAL Synchronization Busy" mask="0x8"/>
          <bitfield name="DFLLMUL" caption="DFLLMUL Synchronization Busy" mask="0x10"/>
        </register>
        <register-group name="DPLL" name-in-module="DPLL" offset="0x30" count="2"/>
      </register-group>
      <value-group name="OSCCTRL_DPLLCTRLB__LTIME">
        <value name="DEFAULT" caption="No time-out. Automatic lock" value="0x0"/>
        <value name="800US" caption="Time-out if no lock within 800us" value="0x4"/>
        <value name="900US" caption="Time-out if no lock within 900us" value="0x5"/>
        <value name="1MS" caption="Time-out if no lock within 1ms" value="0x6"/>
        <value name="1P1MS" caption="Time-out if no lock within 1.1ms" value="0x7"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__REFCLK">
        <value name="GCLK" caption="Dedicated GCLK clock reference" value="0x0"/>
        <value name="XOSC32" caption="XOSC32K clock reference" value="0x1"/>
        <value name="XOSC0" caption="XOSC0 clock reference" value="0x2"/>
        <value name="XOSC1" caption="XOSC1 clock reference" value="0x3"/>
      </value-group>
    </module>
    <module name="OSC32KCTRL" id="U2400" version="1.0.0" caption="32kHz Oscillators Control">
      <register-group name="OSC32KCTRL" caption="32kHz Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSC32KFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSC32KFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="XOSC32KFAIL" caption="XOSC32K Clock Failure Detector" mask="0x4"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="XOSC32KFAIL" caption="XOSC32K Clock Failure Detector" mask="0x4"/>
          <bitfield name="XOSC32KSW" caption="XOSC32K Clock switch" mask="0x8"/>
        </register>
        <register name="RTCCTRL" offset="0x10" rw="RW" size="1" initval="0x00" caption="RTC Clock Selection">
          <bitfield name="RTCSEL" caption="RTC Clock Selection" mask="0x7" values="OSC32KCTRL_RTCCTRL__RTCSEL"/>
        </register>
        <register name="XOSC32K" offset="0x14" rw="RW" size="2" initval="0x2080" caption="32kHz External Crystal Oscillator (XOSC32K) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x8"/>
          <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x10"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="STARTUP" caption="Oscillator Start-Up Time" mask="0x700"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
          <bitfield name="CGM" caption="Control Gain Mode" mask="0x6000" values="OSC32KCTRL_XOSC32K__CGM"/>
        </register>
        <register name="CFDCTRL" offset="0x16" rw="RW" size="1" initval="0x00" caption="Clock Failure Detector Control">
          <bitfield name="CFDEN" caption="Clock Failure Detector Enable" mask="0x1"/>
          <bitfield name="SWBACK" caption="Clock Switch Back" mask="0x2"/>
          <bitfield name="CFDPRESC" caption="Clock Failure Detector Prescaler" mask="0x4"/>
        </register>
        <register name="EVCTRL" offset="0x17" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="CFDEO" caption="Clock Failure Detector Event Output Enable" mask="0x1"/>
        </register>
        <register name="OSCULP32K" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control">
          <bitfield name="EN32K" caption="Enable Out 32k" mask="0x2"/>
          <bitfield name="EN1K" caption="Enable Out 1k" mask="0x4"/>
          <bitfield name="CALIB" caption="Oscillator Calibration" mask="0x3F00"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x8000"/>
        </register>
      </register-group>
      <value-group name="OSC32KCTRL_RTCCTRL__RTCSEL">
        <value name="ULP1K" caption="1.024kHz from 32kHz internal ULP oscillator" value="0"/>
        <value name="ULP32K" caption="32.768kHz from 32kHz internal ULP oscillator" value="1"/>
        <value name="XOSC1K" caption="1.024kHz from 32.768kHz internal oscillator" value="4"/>
        <value name="XOSC32K" caption="32.768kHz from 32.768kHz external crystal oscillator" value="5"/>
      </value-group>
      <value-group name="OSC32KCTRL_XOSC32K__CGM">
        <value name="XT" caption="Standard mode" value="1"/>
        <value name="HS" caption="High Speed mode" value="2"/>
      </value-group>
    </module>
