microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51P19A.atdf
        <register name="INTFLAG" offset="0x1C" rw="RW" size="2" atomic-op="clear:INTFLAG" initval="0x0000" caption="DEVICE Device Interrupt Flag">
          <bitfield name="SUSPEND" caption="Suspend" mask="0x1"/>
          <bitfield name="MSOF" caption="Micro Start of Frame in High Speed Mode" mask="0x2"/>
          <bitfield name="SOF" caption="Start Of Frame" mask="0x4"/>
          <bitfield name="EORST" caption="End of Reset" mask="0x8"/>
          <bitfield name="WAKEUP" caption="Wake Up" mask="0x10"/>
          <bitfield name="EORSM" caption="End Of Resume" mask="0x20"/>
          <bitfield name="UPRSM" caption="Upstream Resume" mask="0x40"/>
          <bitfield name="RAMACER" caption="Ram Access" mask="0x80"/>
          <bitfield name="LPMNYET" caption="Link Power Management Not Yet" mask="0x100"/>
          <bitfield name="LPMSUSP" caption="Link Power Management Suspend" mask="0x200"/>
        </register>
        <register name="EPINTSMRY" offset="0x20" rw="R" size="2" initval="0x0000" caption="DEVICE End Point Interrupt Summary">
          <bitfield name="EPINT0" caption="End Point 0 Interrupt" mask="0x1"/>
          <bitfield name="EPINT1" caption="End Point 1 Interrupt" mask="0x2"/>
          <bitfield name="EPINT2" caption="End Point 2 Interrupt" mask="0x4"/>
          <bitfield name="EPINT3" caption="End Point 3 Interrupt" mask="0x8"/>
          <bitfield name="EPINT4" caption="End Point 4 Interrupt" mask="0x10"/>
          <bitfield name="EPINT5" caption="End Point 5 Interrupt" mask="0x20"/>
          <bitfield name="EPINT6" caption="End Point 6 Interrupt" mask="0x40"/>
          <bitfield name="EPINT7" caption="End Point 7 Interrupt" mask="0x80"/>
        </register>
        <register name="DESCADD" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Descriptor Address">
          <bitfield name="DESCADD" caption="Descriptor Address Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="PADCAL" offset="0x28" rw="RW" size="2" initval="0x0000" caption="USB PAD Calibration">
          <bitfield name="TRANSP" caption="USB Pad Transp calibration" mask="0x1F"/>
          <bitfield name="TRANSN" caption="USB Pad Transn calibration" mask="0x7C0"/>
          <bitfield name="TRIM" caption="USB Pad Trim calibration" mask="0x7000"/>
        </register>
        <register-group name="DEVICE_ENDPOINT" name-in-module="DEVICE_ENDPOINT" offset="0x100" count="8"/>
      </register-group>
      <register-group name="USB_DEVICE_DESCRIPTOR" caption="Universal Serial Bus - USB is Device">
        <register-group name="DEVICE_DESC_BANK" name-in-module="DEVICE_DESC_BANK" offset="0x000" count="2"/>
      </register-group>
      <register-group name="USB_HOST" caption="Universal Serial Bus - USB is Host">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby Mode" mask="0x4"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x80" values="USB_CTRLA__MODE"/>
        </register>
        <register name="SYNCBUSY" offset="0x2" rw="R" size="1" initval="0x00" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
        </register>
        <register name="QOSCTRL" offset="0x3" rw="RW" size="1" initval="0x0F" caption="USB Quality Of Service">
          <bitfield name="CQOS" caption="Configuration Quality of Service" mask="0x3"/>
          <bitfield name="DQOS" caption="Data Quality of Service" mask="0xC"/>
        </register>
        <register name="CTRLB" offset="0x8" rw="RW" size="2" initval="0x0000" caption="HOST Control B">
          <bitfield name="RESUME" caption="Send USB Resume" mask="0x2"/>
          <bitfield name="SPDCONF" caption="Speed Configuration for Host" mask="0xC" values="USB_HOST_CTRLB__SPDCONF"/>
          <bitfield name="AUTORESUME" caption="Auto Resume Enable" mask="0x10"/>
          <bitfield name="TSTJ" caption="Test mode J" mask="0x20"/>
          <bitfield name="TSTK" caption="Test mode K" mask="0x40"/>
          <bitfield name="SOFE" caption="Start of Frame Generation Enable" mask="0x100"/>
          <bitfield name="BUSRESET" caption="Send USB Reset" mask="0x200"/>
          <bitfield name="VBUSOK" caption="VBUS is OK" mask="0x400"/>
          <bitfield name="L1RESUME" caption="Send L1 Resume" mask="0x800"/>
        </register>
        <register name="HSOFC" offset="0xA" rw="RW" size="1" initval="0x00" caption="HOST Host Start Of Frame Control">
          <bitfield name="FLENC" caption="Frame Length Control" mask="0xF"/>
          <bitfield name="FLENCE" caption="Frame Length Control Enable" mask="0x80"/>
        </register>
        <register name="STATUS" offset="0xC" rw="RW" size="1" initval="0x00" caption="HOST Status">
          <bitfield name="SPEED" caption="Speed Status" mask="0xC"/>
          <bitfield name="LINESTATE" caption="USB Line State Status" mask="0xC0"/>
        </register>
        <register name="FSMSTATUS" offset="0xD" rw="R" size="1" initval="0x01" caption="Finite State Machine Status">
          <bitfield name="FSMSTATE" caption="Fine State Machine Status" mask="0x7F" values="USB_FSMSTATUS__FSMSTATE"/>
        </register>
        <register name="FNUM" offset="0x10" rw="RW" size="2" initval="0x0000" caption="HOST Host Frame Number">
          <bitfield name="MFNUM" caption="Micro Frame Number" mask="0x7"/>
          <bitfield name="FNUM" caption="Frame Number" mask="0x3FF8"/>
        </register>
        <register name="FLENHIGH" offset="0x12" rw="R" size="1" initval="0x00" caption="HOST Host Frame Length">
          <bitfield name="FLENHIGH" caption="Frame Length" mask="0xFF"/>
        </register>
        <register name="INTENCLR" offset="0x14" rw="RW" size="2" atomic-op="clear:INTENCLR" initval="0x0000" caption="HOST Host Interrupt Enable Clear">
          <bitfield name="HSOF" caption="Host Start Of Frame Interrupt Disable" mask="0x4"/>
          <bitfield name="RST" caption="BUS Reset Interrupt Disable" mask="0x8"/>
          <bitfield name="WAKEUP" caption="Wake Up Interrupt Disable" mask="0x10"/>
          <bitfield name="DNRSM" caption="DownStream to Device Interrupt Disable" mask="0x20"/>
          <bitfield name="UPRSM" caption="Upstream Resume from Device Interrupt Disable" mask="0x40"/>
          <bitfield name="RAMACER" caption="Ram Access Interrupt Disable" mask="0x80"/>
          <bitfield name="DCONN" caption="Device Connection Interrupt Disable" mask="0x100"/>
          <bitfield name="DDISC" caption="Device Disconnection Interrupt Disable" mask="0x200"/>
        </register>
        <register name="INTENSET" offset="0x18" rw="RW" size="2" atomic-op="set:INTENSET" initval="0x0000" caption="HOST Host Interrupt Enable Set">
          <bitfield name="HSOF" caption="Host Start Of Frame Interrupt Enable" mask="0x4"/>
          <bitfield name="RST" caption="Bus Reset Interrupt Enable" mask="0x8"/>
          <bitfield name="WAKEUP" caption="Wake Up Interrupt Enable" mask="0x10"/>
          <bitfield name="DNRSM" caption="DownStream to the Device Interrupt Enable" mask="0x20"/>
          <bitfield name="UPRSM" caption="Upstream Resume fromthe device Interrupt Enable" mask="0x40"/>
          <bitfield name="RAMACER" caption="Ram Access Interrupt Enable" mask="0x80"/>
          <bitfield name="DCONN" caption="Link Power Management Interrupt Enable" mask="0x100"/>
          <bitfield name="DDISC" caption="Device Disconnection Interrupt Enable" mask="0x200"/>
        </register>
        <register name="INTFLAG" offset="0x1C" rw="RW" size="2" atomic-op="clear:INTFLAG" initval="0x0000" caption="HOST Host Interrupt Flag">
          <bitfield name="HSOF" caption="Host Start Of Frame" mask="0x4"/>
          <bitfield name="RST" caption="Bus Reset" mask="0x8"/>
          <bitfield name="WAKEUP" caption="Wake Up" mask="0x10"/>
          <bitfield name="DNRSM" caption="Downstream" mask="0x20"/>
          <bitfield name="UPRSM" caption="Upstream Resume from the Device" mask="0x40"/>
          <bitfield name="RAMACER" caption="Ram Access" mask="0x80"/>
          <bitfield name="DCONN" caption="Device Connection" mask="0x100"/>
          <bitfield name="DDISC" caption="Device Disconnection" mask="0x200"/>
        </register>
        <register name="PINTSMRY" offset="0x20" rw="R" size="2" initval="0x0000" caption="HOST Pipe Interrupt Summary">
          <bitfield name="EPINT0" caption="Pipe 0 Interrupt" mask="0x1"/>
          <bitfield name="EPINT1" caption="Pipe 1 Interrupt" mask="0x2"/>
          <bitfield name="EPINT2" caption="Pipe 2 Interrupt" mask="0x4"/>
          <bitfield name="EPINT3" caption="Pipe 3 Interrupt" mask="0x8"/>
          <bitfield name="EPINT4" caption="Pipe 4 Interrupt" mask="0x10"/>
          <bitfield name="EPINT5" caption="Pipe 5 Interrupt" mask="0x20"/>
          <bitfield name="EPINT6" caption="Pipe 6 Interrupt" mask="0x40"/>
          <bitfield name="EPINT7" caption="Pipe 7 Interrupt" mask="0x80"/>
        </register>
